"""
    最后更新时间: 2025年7月22日
        英雄和装备数据
"""

# 基本装备
BASIC_ITEM: set[str] = {'不稳定的反曲之弓', '不稳定的女神之泪', '不稳定的巨人腰带', '不稳定的拳套', '不稳定的无用大棒',
                        '不稳定的暴风之剑', '不稳定的负极斗篷', '不稳定的金铲铲', '不稳定的金锅锅', '不稳定的锁子甲',
                        '反曲之弓', '女神之泪', '巨人腰带', '拳套', '无用大棒', '暴风之剑', '次级英雄复制器', '英雄复制器',
                        '装备拆卸器', '装备重铸器', '负极斗篷', '重铸器', '金铲铲', '金锅锅', '锁子甲'
                        }
# 合成装备
COMBINED_ITEMS: set[str] = {'人造人纹章', '伏击专家纹章', '先知纹章', '冕卫', '卢安娜的飓风', '哨兵纹章', '圣灵使者纹章',
                            '圣盾使的誓约', '坚定之心', '堡垒卫士纹章', '夜之锋刃', '大天使之杖', '家人纹章', '巨人杀手',
                            '巨龙之爪', '幻灵战队纹章', '强袭射手纹章', '强袭者的链枷', '征服者纹章', '战地机甲纹章',
                            '战略分析师纹章', '执法官纹章', '振奋盔甲', '搏击手纹章', '救赎', '斗士纹章', '斯塔缇克电刃',
                            '斯特拉克的挑战护手', '无尽之刃', '日炎斗篷', '最后的轻语', '朔极之矛', '杀手纹章', '格斗家纹章',
                            '棘刺背心', '正义之手', '死亡之刃', '水银', '法师纹章', '泰坦的坚决', '海克斯机械纹章',
                            '海克斯科技枪刃', '海妖之怒', '源计划纹章', '灭世者的死亡之帽', '炮手纹章', '狂徒铠甲',
                            '珠光护手', '石像鬼石板甲', '福牛守护者纹章', '离子火花', '窃贼手套', '红霸符', '纳什之牙',
                            '莫雷洛秘典', '蓝发小队纹章', '蓝霸符', '薄暮法袍', '虚空之杖', '街头恶魔纹章', '裁决使纹章',
                            '试验品纹章', '辛迪加纹章', '迅击战士纹章', '迅捷射手纹章', '适应性头盔', '野火帮纹章', '金铲铲冠冕',
                            '金锅铲冠冕', '金锅锅冠冕', '饮血剑', '高级工程师纹章', '鬼索的狂暴之刃', '黑色玫瑰纹章'
                            }
# 合成表
FULL_ITEMS = {
    '黑色玫瑰纹章': [
        '金铲铲',
        '无用大棒'
    ],
    '试验品纹章': [
        '金铲铲',
        '巨人腰带'
    ],
    '家人纹章': [
        '金铲铲',
        '女神之泪'
    ],
    '野火帮纹章': [
        '金铲铲',
        '拳套'
    ],
    '蓝发小队纹章': [
        '金铲铲',
        '反曲之弓'
    ],
    '执法官纹章': [
        '金铲铲',
        '锁子甲'
    ],
    '征服者纹章': [
        '金铲铲',
        '暴风之剑'
    ],
    '海克斯机械纹章': [
        '金铲铲',
        '负极斗篷'
    ],
    '伏击专家纹章': [
        '金锅锅',
        '拳套'
    ],
    '格斗家纹章': [
        '金锅锅',
        '巨人腰带'
    ],
    '迅击战士纹章': [
        '金锅锅',
        '反曲之弓'
    ],
    '炮手纹章': [
        '金锅锅',
        '暴风之剑'
    ],
    '先知纹章': [
        '金锅锅',
        '女神之泪'
    ],
    '搏击手纹章': [
        '金锅锅',
        '负极斗篷'
    ],
    '法师纹章': [
        '金锅锅',
        '无用大棒'
    ],
    '哨兵纹章': [
        '金锅锅',
        '锁子甲'
    ],
    '死亡之刃': [
        '暴风之剑',
        '暴风之剑'
    ],
    '巨人杀手': [
        '暴风之剑',
        '反曲之弓'
    ],
    '海克斯科技枪刃': [
        '暴风之剑',
        '无用大棒'
    ],
    '朔极之矛': [
        '暴风之剑',
        '女神之泪'
    ],
    '饮血剑': [
        '暴风之剑',
        '负极斗篷'
    ],
    '无尽之刃': [
        '暴风之剑',
        '拳套'
    ],
    '鬼索的狂暴之刃': [
        '反曲之弓',
        '无用大棒'
    ],
    '斯塔缇克电刃': [
        '反曲之弓',
        '女神之泪'
    ],
    '泰坦的坚决': [
        '反曲之弓',
        '锁子甲'
    ],
    '卢安娜的飓风': [
        '反曲之弓',
        '负极斗篷'
    ],
    '纳什之牙': [
        '反曲之弓',
        '巨人腰带'
    ],
    '最后的轻语': [
        '反曲之弓',
        '拳套'
    ],
    '灭世者的死亡之帽': [
        '无用大棒',
        '无用大棒'
    ],
    '大天使之杖': [
        '无用大棒',
        '女神之泪'
    ],
    '离子火花': [
        '无用大棒',
        '负极斗篷'
    ],
    '莫雷洛秘典': [
        '无用大棒',
        '巨人腰带'
    ],
    '珠光护手': [
        '无用大棒',
        '拳套'
    ],
    '蓝霸符': [
        '女神之泪',
        '女神之泪'
    ],
    '救赎': [
        '巨人腰带',
        '女神之泪'
    ],
    '正义之手': [
        '拳套',
        '女神之泪'
    ],
    '棘刺背心': [
        '锁子甲',
        '锁子甲'
    ],
    '石像鬼石板甲': [
        '锁子甲',
        '负极斗篷'
    ],
    '日炎斗篷': [
        '巨人腰带',
        '锁子甲'
    ],
    '巨龙之爪': [
        '负极斗篷',
        '负极斗篷'
    ],
    '水银': [
        '负极斗篷',
        '拳套'
    ],
    '狂徒铠甲': [
        '巨人腰带',
        '巨人腰带'
    ],
    '金铲铲冠冕': [
        '金铲铲',
        '金铲铲'
    ],
    '窃贼手套': [
        '拳套',
        '拳套'
    ],
    '强袭者的链枷': [
        '巨人腰带',
        '拳套'
    ],
    '斯特拉克的挑战护手': [
        '暴风之剑',
        '巨人腰带'
    ],
    '冕卫': [
        '无用大棒',
        '锁子甲'
    ],
    '适应性头盔': [
        '女神之泪',
        '负极斗篷'
    ],
    '薄暮法袍': [
        '巨人腰带',
        '负极斗篷'
    ],
    '红霸符': [
        '反曲之弓',
        '反曲之弓'
    ],
    '坚定之心': [
        '锁子甲',
        '拳套'
    ],
    '夜之锋刃': [
        '暴风之剑',
        '锁子甲'
    ],
    '圣盾使的誓约': [
        '锁子甲',
        '女神之泪'
    ],
    '金锅铲冠冕': [
        '金锅锅',
        '金铲铲'
    ],
    '金锅锅冠冕': [
        '金锅锅',
        '金锅锅'
    ],
    '堡垒卫士纹章': [
        '金锅锅',
        '锁子甲'
    ],
    '战地机甲纹章': [
        '金铲铲',
        '锁子甲'
    ],
    '斗士纹章': [
        '金锅锅',
        '巨人腰带'
    ],
    '战略分析师纹章': [
        '金铲铲',
        '暴风之剑'
    ],
    '裁决使纹章': [
        '金锅锅',
        '拳套'
    ],
    '幻灵战队纹章': [
        '金铲铲',
        '女神之泪'
    ],
    '圣灵使者纹章': [
        '金铲铲',
        '反曲之弓'
    ],
    '源计划纹章': [
        '金铲铲',
        '拳套'
    ],
    '福牛守护者纹章': [
        '金铲铲',
        '巨人腰带'
    ],
    '强袭射手纹章': [
        '金锅锅',
        '暴风之剑'
    ],
    '辛迪加纹章': [
        '金铲铲',
        '负极斗篷'
    ],
    '街头恶魔纹章': [
        '金铲铲',
        '无用大棒'
    ],
    '杀手纹章': [
        '金锅锅',
        '负极斗篷'
    ],
    '迅捷射手纹章': [
        '金锅锅',
        '反曲之弓'
    ],
    '高级工程师纹章': [
        '金锅锅',
        '无用大棒'
    ],
    '人造人纹章': [
        '金锅锅',
        '女神之泪'
    ],
    '振奋盔甲': [
        '女神之泪',
        '巨人腰带'
    ],
    '海妖之怒': [
        '负极斗篷',
        '反曲之弓'
    ],
    '虚空之杖': [
        '反曲之弓',
        '女神之泪'
    ]
}
# 不可合成的
NON_CRAFTABLE_ITEMS: set[str] = {'UwU魔爆炮', '一个轻食点心', '便携异常点', '全息弓', '全息瞄准镜', '协调底盘', '命运之子符印',
                                 '回收左轮枪', '回收护手', '回收装置', '回旋刃', '坚定投资器', '大亨之铠', '失稳炼金罐',
                                 '失稳炼金罐 II', '女王卫队的铠甲', '完美失稳炼金罐', '完美微光绽放', '完美毒素倾泻', '完美烈性病毒',
                                 '完美电震军刀', '完美皮城海克斯护甲', '完美行刑官链锯刃', '完美裂肉者', '幻灵地雷', '微光绽放',
                                 '微光绽放 II', '惊喜补给空投', '执事纹章', '投机者之刃', '斥力灯笼', '最终都市列车', '机关兔兔枪',
                                 '极客纹章', '歼灭者', '毒素倾泻', '毒素倾泻 II', '永恒君王的冠冕', '永恒飞行之铠', '消除器灯笼',
                                 '满电量的通量电容器', '漩涡拳套', '炼金男爵纹章', '炽烈短弓', '烈性病毒', '烈性病毒 II', '狙神纹章',
                                 '电震军刀', '电震军刀 II', '皮城学院纹章', '皮城海克斯护甲', '皮城海克斯护甲 II', '监察纹章',
                                 '统领纹章', '脉冲消音器', '脉冲稳定器', '腐化机架', '花仙女王的冠冕', '行刑官链锯刃',
                                 '行刑官链锯刃 II', '被劫持的赛博线圈', '裂肉者', '裂肉者 II', '赛博线圈', '通量电容器',
                                 '重装战士纹章', '附灵飞弹', '顶点尖牙', '高维传家宝', '高能牙刃', '龙卷风'
                                 }


# 辅助装备
SUPPORT_ITEM: set[str] = {"军团圣盾",
                          "女妖面纱",
                          "余烬之冠",
                          "殉道美德",
                          "能量圣杯",
                          "钢铁烈阳之匣",
                          "无用大宝石",
                          "黑曜石切割者",
                          "兰顿之兆",
                          "静止法衣",
                          "基克的先驱",
                          "灵风",
                          "兹若特传送门",
                          "辅助手套",
                          "永恒烈焰",
                          "骑士之誓",
                          "月石再生器",
                          "恶意",
                          "不稳定的财宝箱",
                          }

# 奥恩装备
ORNN_ITEMS: set[str] = {"生命盔甲",
                        "死亡之蔑",
                        "魔蕴",
                        "三相之力",
                        "永恒凛冬",
                        "金币收集者",
                        "中娅悖论",
                        "碎舰者",
                        "诡术师之镜",
                        "狙击手的专注",
                        "冥火之拥",
                        "铁匠手套",
                        "钻石之手",
                        "飞升护符",
                        "黑暗吸血鬼节杖",
                        "鱼骨头",
                        "迷离风衣",
                        "视界专注",
                        "连指手套",
                        "无终恨意",
                        "疾射火炮",
                        "激发之匣",
                        "卢登的激荡",
                        "密银黎明",
                        "暗行者之爪",
                        "幽魂弯刀",
                        "枯萎珠宝",
                        "智慧末刃",
                        "禁忌雕像",
                        "巫妖之祸",
                        "光盾徽章",
                        "探索者的护臂",
                        }

# 光明装备
SACRED_ITEMS: set[str] = {
    "意志破坏者",
    "余烬之冠",
    "巨像的传承",
    "壁垒的誓言",
    "光辉之刃",
    "恶魔杀手",
    "海克斯科技生命之刃",
    "希拉娜之矛",
    "黎明锋刃",
    "福佑饮血剑",
    "斯特拉克的究极盾牌",
    "天顶锋刃",
    "鬼索的清算",
    "斯塔缇克狂热",
    "泰坦的誓言",
    "卢安娜的风暴",
    "男爵赠礼",
    "永恒轻语",
    "灭世者的飞升之帽",
    "阿福天使之杖",
    "皇家冕盾",
    "神圣离子火花",
    "莫雷洛圣典",
    "圣洁珠光护手",
    "圣蓝祝福",
    "千变者贾修",
    "赦除",
    "绝对正义之拳",
    "瑰刺背心",
    "天神石板甲",
    "日光斗篷",
    "巨龙意志",
    "星体结界",
    "至速水银",
    "狂徒之傲",
    "光明窃贼手套",
    "杰作升级"
}
# 光明映射装备
SACRED_MATCHED_GROUP = {
    "意志破坏者": "破防者",
    "余烬之冠": "红霸符",
    "巨像的传承": "坚定之心",
    "壁垒的誓言": "圣盾使的誓约",
    "光辉之刃": "死亡之刃",
    "恶魔杀手": "巨人杀手",
    "海克斯科技生命之刃": "海克斯科技枪刃",
    "希拉娜之矛": "朔极之矛",
    "黎明锋刃": "夜之锋刃",
    "福佑饮血剑": "饮血剑",
    "斯特拉克的究极盾牌": "斯特拉克的挑战护手",
    "天顶锋刃": "无尽之刃",
    "鬼索的清算": "鬼索的狂暴之刃",
    "斯塔缇克狂热": "斯塔缇克电刃",
    "泰坦的誓言": "泰坦的坚决",
    "卢安娜的风暴": "卢安娜的飓风",
    "男爵赠礼": "纳什之牙",
    "永恒轻语": "最后的轻语",
    "灭世者的飞升之帽": "灭世者的死亡之帽",
    "阿福天使之杖": "大天使之杖",
    "皇家冕盾": "冕卫",
    "神圣离子火花": "离子火花",
    "莫雷洛圣典": "莫雷洛秘典",
    "圣洁珠光护手": "珠光护手",
    "圣蓝祝福": "蓝霸符",
    "千变者贾修": "适应性头盔",
    "赦除": "救赎",
    "绝对正义之拳": "正义之手",
    "瑰刺背心": "棘刺背心",
    "天神石板甲": "石像鬼石板甲",
    "日光斗篷": "日炎斗篷",
    "巨龙意志": "巨龙之爪",
    "星体结界": "薄暮法袍",
    "至速水银": "水银",
    "狂徒之傲": "狂徒铠甲",
    "光明窃贼手套": "窃贼手套"
}

# 前排预设装备名单
FRONTLINE_ITEMS: set[str] = {
    "锁子甲",
    "负极斗篷",
    "巨人腰带",
    "军团圣盾",
    "女妖面纱",
    "殉道美德",
    "钢铁烈阳之匣",
    "无用大宝石",
    "兰顿之兆",
    "兹若特传送门",
    "永恒烈焰",
    "骑士之誓",
    "不稳定的财宝箱",
    "大亨之铠",
    "生命盔甲",
    "永恒凛冬",
    "碎舰者",
    "诡术师之镜",
    "密银黎明",
    "暗行者之爪",
    "幽魂弯刀",
    "禁忌雕像",
    "光盾徽章",
    "探索者的护臂",
    "破防者"

}

# 后排预设装备名单
REAR_ITEMS: set[str] = {
    "暴风之剑",
    "反曲之弓",
    "无用大棒",
    "女神之泪",
    "拳套",
    "余烬之冠",
    "能量圣杯",
    "黑曜石切割者",
    "静止法衣",
    "基克的先驱",
    "灵风",
    "辅助手套",
    "月石再生器",
    "恶意",
    "投机者之刃",
    "坚定投资器",
    "死亡之蔑",
    "魔蕴",
    "三相之力",
    "金币收集者",
    "中娅悖论",
    "狙击手的专注",
    "冥火之拥",
    "铁匠手套",
    "钻石之手",
    "飞升护符",
    "黑暗吸血鬼节杖",
    "鱼骨头",
    "迷离风衣",
    "视界专注",
    "连指手套",
    "无终恨意",
    "疾射火炮",
    "激发之匣",
    "卢登的激荡",
    "枯萎珠宝",
    "智慧末刃",
    "巫妖之祸",

}

# 默认英雄信息 英雄名称:金币:x,占人口容量:x,羁绊1:羁绊信息,羁绊2:羁绊信息,羁绊3:羁绊信息
CHAMPIONS: dict[str, dict[str, int | str]] = {
    '魔像': {
        'Gold': 0,
        'Board Size': 1,
        'Trait1': '',
        'Trait2': '召唤物',
        'Trait3': ''
    },
    '布兰德': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '高级工程师',
        'Trait3': ''
    },
    '德莱厄斯': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '辛迪加',
        'Trait2': '斗士',
        'Trait3': ''
    },
    '蒙多医生': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '斗士',
        'Trait3': '杀手'
    },
    '伊莉丝': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '魔装机神',
        'Trait2': '人造人',
        'Trait3': ''
    },
    '费德提克': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '战地机甲',
        'Trait2': '高级工程师',
        'Trait3': ''
    },
    '加里奥': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '执事',
        'Trait2': '堡垒卫士',
        'Trait3': ''
    },
    '盖伦': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '网络之神',
        'Trait2': '',
        'Trait3': ''
    },
    '乐芙兰': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '执事',
        'Trait2': '战略分析师',
        'Trait3': ''
    },
    '厄运小姐': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '辛迪加',
        'Trait2': '人造人',
        'Trait3': ''
    },
    '莫甘娜': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '圣灵使者',
        'Trait2': '人造人',
        'Trait3': ''
    },
    '妮蔻': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '战略分析师',
        'Trait3': ''
    },
    '雷克顿': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '鳄霸,圣灵使者',
        'Trait2': '堡垒卫士',
        'Trait3': ''
    },
    '雷恩加尔': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '裁决使',
        'Trait3': ''
    },
    '莎弥拉': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '超频战士',
        'Trait3': ''
    },
    '赛娜': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '圣灵使者',
        'Trait2': '杀手',
        'Trait3': ''
    },
    '萨科': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '辛迪加',
        'Trait2': '杀手',
        'Trait3': ''
    },
    '崔斯特': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '辛迪加',
        'Trait2': '迅捷射手',
        'Trait3': ''
    },
    '韦鲁斯': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '裁决使',
        'Trait3': ''
    },
    '维迦': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '赛博老大',
        'Trait2': '高级工程师',
        'Trait3': ''
    },
    '薇古丝': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '圣灵使者',
        'Trait2': '裁决使',
        'Trait3': ''
    },
    '劫': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '执事',
        'Trait2': '杀手',
        'Trait3': ''
    },
    '泽丽': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '迅捷射手',
        'Trait3': ''
    },
    '婕拉': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '高级工程师',
        'Trait3': ''
    },
    '布隆': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '辛迪加',
        'Trait2': '重装战士',
        'Trait3': ''
    },
    '奈德丽': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '魔装机神',
        'Trait2': '超频战士',
        'Trait3': ''
    },
    '希瓦娜': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '魔装机神',
        'Trait2': '堡垒卫士',
        'Trait3': '高级工程师'
    },
    '千珏': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '魔装机神',
        'Trait2': '迅捷射手',
        'Trait3': '强袭射手'
    },
    '悠米': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '超频战士',
        'Trait3': '战略分析师'
    },
    '俄洛伊': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '堡垒卫士',
        'Trait3': ''
    },
    '萨勒芬妮': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '高级工程师',
        'Trait3': ''
    },
    '霞': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '强袭射手',
        'Trait3': ''
    },
    '烬': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '强袭射手',
        'Trait3': '人造人'
    },
    '纳亚菲利': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '超频战士',
        'Trait3': ''
    },
    '古拉加斯': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '圣灵使者',
        'Trait2': '斗士',
        'Trait3': ''
    },
    '克格莫': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '战地机甲',
        'Trait2': '迅捷射手',
        'Trait3': ''
    },
    '斯卡纳': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '战地机甲',
        'Trait2': '重装战士',
        'Trait3': ''
    },
    '贾克斯': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '堡垒卫士',
        'Trait3': ''
    },
    '可酷伯': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '赛博老大',
        'Trait2': '斗士',
        'Trait3': ''
    },
    '瑟庄妮': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '堡垒卫士',
        'Trait3': ''
    },
    '波比': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '赛博老大',
        'Trait2': '堡垒卫士',
        'Trait3': ''
    },
    '吉格斯': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '赛博老大',
        'Trait2': '战略分析师',
        'Trait3': ''
    },
    '科加斯': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '战地机甲',
        'Trait2': '斗士',
        'Trait3': ''
    },
    '厄加特': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '战地机甲',
        'Trait2': '裁决使',
        'Trait3': ''
    },
    '塞拉斯': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '重装战士',
        'Trait3': ''
    },
    '阿萝拉': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '人造人',
        'Trait3': ''
    },
    '薇恩': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '杀手',
        'Trait3': ''
    },
    '蕾欧娜': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '幻灵战队',
        'Trait2': '重装战士',
        'Trait3': ''
    },
    '蔚': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '执事',
        'Trait2': '重装战士',
        'Trait3': ''
    },
    '莫德凯撒': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '源计划',
        'Trait2': '斗士',
        'Trait3': '高级工程师'
    },
    '阿利斯塔': {
        'Gold': 1,
        'Board Size': 1,
        'Trait1': '福牛守护者',
        'Trait2': '斗士',
        'Trait3': ''
    },
    '佛耶戈': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '弑魂者,福牛守护者',
        'Trait2': '高级工程师',
        'Trait3': ''
    },
    '嘉文四世': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '福牛守护者',
        'Trait2': '重装战士',
        'Trait3': '杀手'
    },
    '格雷福斯': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '福牛守护者',
        'Trait2': '裁决使',
        'Trait3': ''
    },
    '安妮': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '福牛守护者',
        'Trait2': '超频战士',
        'Trait3': ''
    },
    '拉亚斯特': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '圣灵使者',
        'Trait2': '重装战士',
        'Trait3': ''
    },
    'R-080T': {
        'Gold': 0,
        'Board Size': 1,
        'Trait1': '',
        'Trait2': '召唤物',
        'Trait3': ''
    },
    'T-43X': {
        'Gold': 0,
        'Board Size': 1,
        'Trait1': '',
        'Trait2': '召唤物',
        'Trait3': ''
    },
    '德莱文': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '执事',
        'Trait2': '迅捷射手',
        'Trait3': ''
    },
    '扎克': {
        'Gold': 5,
        'Board Size': 1,
        'Trait1': '病毒魔人',
        'Trait2': '',
        'Trait3': ''
    },
    '金克丝': {
        'Gold': 3,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '强袭射手',
        'Trait3': ''
    },
    '艾克': {
        'Gold': 2,
        'Board Size': 1,
        'Trait1': '街头恶魔',
        'Trait2': '战略分析师',
        'Trait3': ''
    },
    'T-URR37': {
        'Gold': 0,
        'Board Size': 1,
        'Trait1': '',
        'Trait2': '召唤物',
        'Trait3': ''
    },
    '厄斐琉斯': {
        'Gold': 4,
        'Board Size': 1,
        'Trait1': '福牛守护者',
        'Trait2': '强袭射手',
        'Trait3': ''
    }
}

ROUNDS: set[str] = {"1-1", "1-2", "1-3", "1-4",
                    "2-1", "2-2", "2-3", "2-4", "2-5", "2-6", "2-7", "2-8",
                    "3-1", "3-2", "3-3", "3-4", "3-5", "3-6", "3-7", "3-8",
                    "4-1", "4-2", "4-3", "4-4", "4-5", "4-6", "4-7", "4-8",
                    "5-1", "5-2", "5-3", "5-4", "5-5", "5-6", "5-7", "5-8",
                    "6-1", "6-2", "6-3", "6-4", "6-5", "6-6", "6-7", "6-8",
                    "7-1", "7-2", "7-3", "7-4", "7-5", "7-6", "7-7", "7-8"}

SECOND_ROUND: set[str] = {"1-2"}

# 选秀回合
CAROUSEL_ROUND: set[str] = {"1-1", "2-4", "3-4", "4-4", "5-4", "6-4", "7-4"}

PVE_ROUND: set[str] = {"1-3", "1-4", "2-7", "3-7", "4-6", "4-7", "5-7", "6-7", "7-7"}

PVP_ROUND: set[str] = {"2-1", "2-2", "2-3", "2-5", "2-6",
                       "3-1", "3-2", "3-3", "3-5", "3-6",
                       "4-1", "4-2", "4-3", "4-5",
                       "5-1", "5-2", "5-3", "5-5", "5-6",
                       "6-1", "6-2", "6-3", "6-5", "6-6",
                       "7-1", "7-2", "7-3", "7-5", "7-6"}
# 拾取战利品回合
PICKUP_ROUNDS: set[str] = {"2-1", "3-1", "4-1", "4-3", "5-1", "6-1", "7-1"}

ANVIL_ROUNDS: set[str] = {"2-1", "2-5", "3-1", "3-5", "4-1", "4-5", "5-1", "5-5", "6-1", "6-5", "7-1", "7-5"}

# 强化符文回合
AUGMENT_ROUNDS: set[str] = {"2-1", "3-2", "4-2"}

# 这些回合给装备
ITEM_PLACEMENT_ROUNDS: set[str] = {
    "2-1", "2-5", "2-7",
    "3-3", "3-5", "3-7",
    "4-2", "4-3", "4-4", "4-7",
    "5-1", "5-2", "5-3", "5-4", "5-5", "5-7",
    "6-1", "6-2", "6-3", "6-5", "6-6", "6-7",
    "7-1", "7-2", "7-3", "7-5", "7-6", "7-7"
}
# 刚开始的回合
ENCOUNTER_ROUNDS: set[str] = {"0-0"}

# 自动投降回合
FINAL_COMP_ROUND = "5-5"

# 所有装备
ITEMS: set[str] = BASIC_ITEM.union(COMBINED_ITEMS).union(SUPPORT_ITEM).union(NON_CRAFTABLE_ITEMS).union(
    ORNN_ITEMS).union(SACRED_ITEMS)

# 铁砧奇遇
ANVIL_PORTALS: list[str] = [
    "基础装备锻造器",
]
# 假人等奇遇
DUMMY_PORTALS: list[str] = [
    "魔像训练师",
]
ADDITIONAL_AUGMENT: list[str] = [
    "黑入:笫四个强化符文",
]

def champion_board_size(champion: str) -> int:
    """Takes a string (champion name) and returns board size of champion"""
    return CHAMPIONS[champion]["Board Size"]


def champion_gold_cost(champion: str) -> int:
    """根据字符串（英雄名称）返回英雄购买需要的金币"""
    return CHAMPIONS[champion]["Gold"]
